In [2]:
import pandas as pd
import json

df = pd.read_json('saci.json')

df_normalized = pd.json_normalize(df['solution'])

df_combined = pd.concat([df.drop('solution', axis=1), df_normalized], axis=1)

df = df_combined

In [4]:
df.head(3)

,id,bloco,nome,capacidade,tipo,acessivel,preferencias,execao,classes
0,1104,CI,102,57,Sala,False,"[{'name': 'CI-DCC', 'value': 1}, {'name': 'CI-...",undefined,"[{'id': 5341, 'codigo': '1107131', 'nome': 'PE..."
1,1105,LIEPE,04,69,Sala,False,"[{'name': 'CI-DCC', 'value': 1}, {'name': 'CI-...",undefined,"[{'id': 5352, 'codigo': 'GDSCO0062', 'nome': '..."
2,1106,CI,104,32,Sala,False,"[{'name': 'CI-DCC', 'value': 1}, {'name': 'CI-...",undefined,"[{'id': 5359, 'codigo': 'GDCOC0095', 'nome': '..."

In [6]:
salas = df.drop(columns = ['preferencias', 'execao', 'acessivel', 'id', 'classes'])
salas.head(3)

   bloco nome  capacidade  tipo
0     CI  102          57  Sala
1  LIEPE   04          69  Sala
2     CI  104          32  Sala

In [7]:
print(salas['tipo'].unique())

['Sala' 'Laboratório' 'Lab Hardware']

In [8]:
def troca(valor):
    if valor == "Lab Hardware":
        valor = "Laboratório"
    elif valor == "Sala":
        valor = "Sala"
    elif valor == "Laboratório":
        valor = "Laboratório"
    return valor

salas['tipo'] = salas['tipo'].apply(troca)
print(salas['tipo'].unique())

['Sala' 'Laboratório']

In [10]:
salas[:3]

   bloco nome  capacidade  tipo
0     CI  102          57  Sala
1  LIEPE   04          69  Sala
2     CI  104          32  Sala

In [8]:
salas.to_csv('salas.csv', index = False)

In [18]:
classes = df['classes']
classes[0][0] # Primeira classe da primeira sala

{'id': 5341,
 'codigo': '1107131',
 'nome': 'PESQUISA OPERACIONAL',
 'turma': '1',
 'docente': 'ANAND SUBRAMANIAN',
 'departamento': 'PPG-I',
 'horario': '6T456 6N1',
 'alunos': '3',
 'preferencias': [{'name': 'Sala', 'value': 10},
  {'name': 'Laboratório', 'value': 0},
  {'name': 'Lab Hardware', 'value': 0}],
 'pcd': False,
 'pre_alocacao': 'CI 102'}

In [19]:
# Crie uma lista vazia para armazenar os DataFrames separados
dataframes = []

# Itera sobre a série e converte cada elemento em um DataFrame
for element in classes:
    df = pd.DataFrame(element)
    dataframes.append(df)

# Imprima cada DataFrame separadamente
# for idx, df in enumerate(dataframes):
    #print(f"DataFrame {idx}:")
    #print(df)
    #print()

In [20]:
df = pd.concat(dataframes)

In [22]:
df.head(3)

,id,codigo,nome,turma,docente,departamento,horario,alunos,preferencias,pcd,pre_alocacao
0,5341,1107131,PESQUISA OPERACIONAL,1,ANAND SUBRAMANIAN,PPG-I,6T456 6N1,3,"[{'name': 'Sala', 'value': 10}, {'name': 'Labo...",False,CI 102
1,5342,GDSCO0046,FÍSICA EXPERIMENTAL PARA COMPUTAÇÃO,3,JAIRO ROCHA DE FARIA,CI-DSC,5T23,40,"[{'name': 'Sala', 'value': 10}, {'name': 'Labo...",False,CI 102
2,5343,1107201,METODOLOGIA DO TRABALHO CIENTIFICO,2,THAIS GAUDENCIO DO REGO,CI-DI,3T456,57,"[{'name': 'Sala', 'value': 10}, {'name': 'Labo...",False,CI 102

In [23]:
df.iloc[0]['preferencias']

[{'name': 'Sala', 'value': 10},
 {'name': 'Laboratório', 'value': 0},
 {'name': 'Lab Hardware', 'value': 0}]

In [25]:
preferencias = []

for i in range(len(df)):
    preferencia = df.iloc[i]['preferencias'][0]['name']
    preferencias.append(preferencia)
df['preferencia'] = preferencias
df[:3]

,id,codigo,nome,turma,docente,departamento,horario,alunos,preferencias,pcd,pre_alocacao,preferencia
0,5341,1107131,PESQUISA OPERACIONAL,1,ANAND SUBRAMANIAN,PPG-I,6T456 6N1,3,"[{'name': 'Sala', 'value': 10}, {'name': 'Labo...",False,CI 102,Sala
1,5342,GDSCO0046,FÍSICA EXPERIMENTAL PARA COMPUTAÇÃO,3,JAIRO ROCHA DE FARIA,CI-DSC,5T23,40,"[{'name': 'Sala', 'value': 10}, {'name': 'Labo...",False,CI 102,Sala
2,5343,1107201,METODOLOGIA DO TRABALHO CIENTIFICO,2,THAIS GAUDENCIO DO REGO,CI-DI,3T456,57,"[{'name': 'Sala', 'value': 10}, {'name': 'Labo...",False,CI 102,Sala

In [26]:
df = df.drop(columns = 'preferencias')
df = df.drop(columns = 'departamento')
df = df.drop(columns = 'docente')
df = df.drop(columns = 'pcd')
df = df.drop(columns = 'pre_alocacao')
df = df.drop(columns = 'codigo')
df[:3]

,id,nome,turma,horario,alunos,preferencia
0,5341,PESQUISA OPERACIONAL,1,6T456 6N1,3,Sala
1,5342,FÍSICA EXPERIMENTAL PARA COMPUTAÇÃO,3,5T23,40,Sala
2,5343,METODOLOGIA DO TRABALHO CIENTIFICO,2,3T456,57,Sala

In [27]:
print(df['preferencia'].unique())
def troca(valor):
    if valor == "Lab Hardware":
        valor = "Laboratório"
    elif valor == "Sala":
        valor = "Sala"
    elif valor == "Laboratório":
        valor = "Laboratório"
    return valor

df['preferencia'] = df['preferencia'].apply(troca)
print(df['preferencia'].unique())

['Sala' 'Laboratório' 'Lab Hardware']
['Sala' 'Laboratório']

In [28]:
print((df['horario'].unique()))

['6T456 6N1' '5T23' '3T456' '24M45' '5M1  24T45' '35M23' '24M23' '35M45'
 '6M2345' '24T23' '3T23' '35T23' '35T45' '3T234' '36M23' '4T2345' '24T45'
 '6M345' '6T23' '24T56' '5M23' '2M45' '4M45' '3M23' '4M23' '6M45' '2T234'
 '6T2345' '246T23']

6M345          3
5M23           3
36M23          2
5T23           2
4M45           2
3M23           2
2M45           2
4M23           2
6M2345         2
2T234          1
6T2345         1
6M45           1
6T456 6N1      1
24T56          1
6T23           1
4T2345         1
3T234          1
3T23           1
5M1  24T45     1
3T456          1
246T23         1

# Criação dos CSV's

In [ ]:
#df.to_csv('turmas.csv', index = False)

In [ ]:
SQT45 = df[df['horario'] == '24T45']
SQT45.to_csv('SQT45.csv', index = False)

TQT45 = df[df['horario'] == '35T45']
TQT45.to_csv('TQT45.csv', index = False)

SQM23 = df[df['horario'] == '24M23']
SQM23.to_csv('SQM23.csv', index = False)

SQT23 = df[df['horario'] == '24T23']
SQT23.to_csv('SQT23.csv', index = False)

TQM23 = df[df['horario'] == '35M23']
TQM23.to_csv('TQM23.csv', index = False)

SQM45 = df[df['horario'] == '24M45']
SQM45.to_csv('SQM45.csv', index = False)

TQT23 = df[df['horario'] == '35T23']
TQT23.to_csv('TQT23.csv', index = False)

TQM45 = df[df['horario'] == '35M45']
TQM45.to_csv('TQM45.csv', index = False)

TQM23 = df[df['horario'] == '35M23']
TQM23.to_csv('TQM23.csv', index = False)

In [ ]:
turmas_especiais = df[~df['horario'].isin(['35M45','24M45','35T23','35M23','24T23','24M23','35T45','24T45'])] # Todas as que não forem as anteriores
turmas_especiais.to_csv('turmas_especiais.csv', index = False)